In [2]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Name change

In [3]:
old_name = 'SCBB'
new_name = 'SCB'

In [4]:
sql = '''
SELECT *
FROM stockname
WHERE name = "%s"'''
sql = sql % (old_name)
stock = pd.read_sql(sql, const)
stock

   name category sector  inport  onwatch  hd  top100
0  SCBB    SET50   BANK       0        0   0       1

In [5]:
sql = '''
UPDATE stockname
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stockname
SET name = "SCB"
WHERE name = "SCBB"

In [6]:
rp = const.execute(sql)
rp.rowcount

1

In [7]:
sql = '''
SELECT *
FROM price
WHERE name = "%s"'''
sql = sql % (old_name)
price = pd.read_sql(sql, const)
price.shape

(1452, 7)

In [8]:
sql = '''
UPDATE price
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE price
SET name = "SCB"
WHERE name = "SCBB"

In [9]:
rp = const.execute(sql)
rp.rowcount

1452

In [10]:
sql_del = '''
DELETE FROM price
WHERE date = "2021-12-03"
'''
#rp = const.execute(sql_del)
rp.rowcount

1452

In [11]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "SCB"
WHERE name = "SCBB"

In [12]:
rp = conlite.execute(sql)
rp.rowcount

1

### Tickers table

In [13]:
sql = '''
SELECT *
FROM tickers
WHERE name = "%s"'''
sql = sql % (old_name)
ticker = pd.read_sql(sql, conlt)
ticker

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,426,SCBB,THE SIAM COMMERCIAL BANK PUBLIC COMPANY LIMITED,Financials,Banking,SET50 / SETCLMV / SETTHSI,www.scb.co.th,2017-07-23 06:31:44.091944,2022-01-15 03:54:13.062428

In [14]:
sql = '''
UPDATE tickers
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE tickers
SET name = 'SCB'
WHERE name = 'SCBB'

In [15]:
rp = conlt.execute(sql)
rp.rowcount

1

In [16]:
rp = conmy.execute(sql)
rp.rowcount

1

In [17]:
rp = conpg.execute(sql)
rp.rowcount

1

### Stocks table

In [18]:
sql = '''
UPDATE stocks
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = 'SCB'
WHERE name = 'SCBB'

In [19]:
rp = conlt.execute(sql)
rp.rowcount

1

In [20]:
rp = conmy.execute(sql)
rp.rowcount

1

In [21]:
rp = conpg.execute(sql)
rp.rowcount

1

### EPSS table

In [22]:
sql = '''
UPDATE epss
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE epss
SET name = 'SCB'
WHERE name = 'SCBB'

In [23]:
rp = conlt.execute(sql)
rp.rowcount

45

In [24]:
rp = conpg.execute(sql)
rp.rowcount

45

### QT_PROFITS table

In [25]:
sql = '''
UPDATE qt_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE qt_profits
SET name = 'SCB'
WHERE name = 'SCBB'

In [26]:
rp = conlt.execute(sql)
rp.rowcount

27

### YR_PROFITS table

In [27]:
sql = '''
UPDATE yr_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE yr_profits
SET name = 'SCB'
WHERE name = 'SCBB'

In [28]:
rp = conlt.execute(sql)
rp.rowcount

29

In [29]:
rp = conpg.execute(sql)
rp.rowcount

29

### PROFITS table

In [30]:
sql = '''
UPDATE profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE profits
SET name = 'SCB'
WHERE name = 'SCBB'

In [31]:
rp = conlt.execute(sql)
rp.rowcount

1

In [32]:
rp = conmy.execute(sql)
rp.rowcount

1

In [33]:
rp = conpg.execute(sql)
rp.rowcount

1

### CONSENSUS table

In [34]:
sql = '''
UPDATE consensus
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE consensus
SET name = 'SCB'
WHERE name = 'SCBB'

In [35]:
rp = conlt.execute(sql)
rp.rowcount

1

In [36]:
rp = conmy.execute(sql)
rp.rowcount

1

In [37]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [38]:
sql = '''
SELECT * 
FROM stocks
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

Empty DataFrame
Columns: [id, name, category_id, website]
Index: []

In [41]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "SCB"
WHERE name = "SCBB"

In [42]:
rp = conpf.execute(sql)
rp.rowcount

0

In [43]:
sql = '''
SELECT * 
FROM dividends
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

Empty DataFrame
Columns: [id, stock_id, name, year, quarter, number, ppu, amt, net, x_date, p_date]
Index: []

In [44]:
sql = '''
UPDATE dividends
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE dividends
SET name = "SCB"
WHERE name = "SCBB"

In [45]:
rp = conpf.execute(sql)
rp.rowcount

0